source/hibernate-relanation.html
<?xml version="1.0" encoding="gbk"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>hibernate关系映射小结</title>
<meta http-equiv="Content-Type" content="text/html;charset=gbk"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-11-09 18:57:03 "/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="org.css">

</head>
<body>
<div id="content">

<h1 class="title">hibernate关系映射小结</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 实体类 </a>
<ul>
<li><a href="#sec-1.1">1.1 单向 </a>
<ul>
<li><a href="#sec-1.1.1">1.1.1 一对一 </a></li>
<li><a href="#sec-1.1.2">1.1.2 一对多 </a></li>
<li><a href="#sec-1.1.3">1.1.3 多对一 </a></li>
<li><a href="#sec-1.1.4">1.1.4 多对多 </a></li>
</ul>
</li>
<li><a href="#sec-1.2">1.2 双向 </a>
<ul>
<li><a href="#sec-1.2.1">1.2.1 一对一 </a></li>
<li><a href="#sec-1.2.2">1.2.2 一对多 </a></li>
<li><a href="#sec-1.2.3">1.2.3 多对多 </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 表模型 </a>
<ul>
<li><a href="#sec-2.1">2.1 单向 </a>
<ul>
<li><a href="#sec-2.1.1">2.1.1 外键 </a></li>
<li><a href="#sec-2.1.2">2.1.2 主键 </a></li>
<li><a href="#sec-2.1.3">2.1.3 连接表 </a></li>
</ul>
</li>
<li><a href="#sec-2.2">2.2 双向 </a>
<ul>
<li><a href="#sec-2.2.1">2.2.1 一对一 </a></li>
<li><a href="#sec-2.2.2">2.2.2 一对多 </a></li>
<li><a href="#sec-2.2.3">2.2.3 多对多 </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-3">3 映射定义 </a>
<ul>
<li><a href="#sec-3.1">3.1 单向 </a>
<ul>
<li><a href="#sec-3.1.1">3.1.1 一对一 </a></li>
<li><a href="#sec-3.1.2">3.1.2 一对多 </a></li>
<li><a href="#sec-3.1.3">3.1.3 多对一 </a></li>
<li><a href="#sec-3.1.4">3.1.4 多对多 </a></li>
</ul>
</li>
<li><a href="#sec-3.2">3.2 双向 </a>
<ul>
<li><a href="#sec-3.2.1">3.2.1 一对一 </a></li>
<li><a href="#sec-3.2.2">3.2.2 一对多 </a></li>
<li><a href="#sec-3.2.3">3.2.3 多对一 </a></li>
<li><a href="#sec-3.2.4">3.2.4 多对多 </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 实体类 </h2>
<div class="outline-text-2" id="text-1">

<p>相同类型对应关系(不分外键主键连接表)实体类完全相同<br/>
</p>
</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> 单向 </h3>
<div class="outline-text-3" id="text-1.1">


</div>

<div id="outline-container-1.1.1" class="outline-4">
<h4 id="sec-1.1.1"><span class="section-number-4">1.1.1</span> 一对一 </h4>
<div class="outline-text-4" id="text-1.1.1">

<p>一个类正常<br/>
一个类包含另一个类作为其属性<br/>
</p></div>

</div>

<div id="outline-container-1.1.2" class="outline-4">
<h4 id="sec-1.1.2"><span class="section-number-4">1.1.2</span> 一对多 </h4>
<div class="outline-text-4" id="text-1.1.2">

<p>一个类正常<br/>
一个类的Set集合来作为另一个类的属性<br/>
</p></div>

</div>

<div id="outline-container-1.1.3" class="outline-4">
<h4 id="sec-1.1.3"><span class="section-number-4">1.1.3</span> 多对一 </h4>
<div class="outline-text-4" id="text-1.1.3">

<p>同一对一<br/>
</p></div>

</div>

<div id="outline-container-1.1.4" class="outline-4">
<h4 id="sec-1.1.4"><span class="section-number-4">1.1.4</span> 多对多 </h4>
<div class="outline-text-4" id="text-1.1.4">

<p>同一对多<br/>
</p></div>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> 双向 </h3>
<div class="outline-text-3" id="text-1.2">


</div>

<div id="outline-container-1.2.1" class="outline-4">
<h4 id="sec-1.2.1"><span class="section-number-4">1.2.1</span> 一对一 </h4>
<div class="outline-text-4" id="text-1.2.1">

<p>2个类都互为对方的属性<br/>
都实现Serializable接口<br/>
都含有Long id 作为其属性 <br/>
</p></div>

</div>

<div id="outline-container-1.2.2" class="outline-4">
<h4 id="sec-1.2.2"><span class="section-number-4">1.2.2</span> 一对多 </h4>
<div class="outline-text-4" id="text-1.2.2">

<p>都实现Serializable接口<br/>
一个类的Set集合来作为另一个类的属性<br/>
一个类作为另一个类的属性<br/>
</p></div>

</div>

<div id="outline-container-1.2.3" class="outline-4">
<h4 id="sec-1.2.3"><span class="section-number-4">1.2.3</span> 多对多 </h4>
<div class="outline-text-4" id="text-1.2.3">

<p>一个类的Set集合来互相作为对方类的属性  <br/>
</p></div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 表模型 </h2>
<div class="outline-text-2" id="text-2">

<p>相同键关联类型(不分对应关系)表模型相同<br/>
</p>
</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> 单向 </h3>
<div class="outline-text-3" id="text-2.1">


</div>

<div id="outline-container-2.1.1" class="outline-4">
<h4 id="sec-2.1.1"><span class="section-number-4">2.1.1</span> 外键 </h4>
<div class="outline-text-4" id="text-2.1.1">

<p>一个表中的主键在另一个表中<br/>
</p></div>

</div>

<div id="outline-container-2.1.2" class="outline-4">
<h4 id="sec-2.1.2"><span class="section-number-4">2.1.2</span> 主键 </h4>
<div class="outline-text-4" id="text-2.1.2">

<p>正常<br/>
</p></div>

</div>

<div id="outline-container-2.1.3" class="outline-4">
<h4 id="sec-2.1.3"><span class="section-number-4">2.1.3</span> 连接表 </h4>
<div class="outline-text-4" id="text-2.1.3">

<p>新增连接表,其中一个表的主键在连接表中做主键<br/>
</p></div>
</div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2"><span class="section-number-3">2.2</span> 双向 </h3>
<div class="outline-text-3" id="text-2.2">


</div>

<div id="outline-container-2.2.1" class="outline-4">
<h4 id="sec-2.2.1"><span class="section-number-4">2.2.1</span> 一对一 </h4>
<div class="outline-text-4" id="text-2.2.1">

<ul>
<li id="sec-2.2.1.1">外键 <br/>
2个表中有相同列 id作为其主键<br/>
一个表的主键在另一个表中<br/>
</li>
<li id="sec-2.2.1.2">主键 <br/>
2个表中有相同列 id来进行关联<br/>
</li>
<li id="sec-2.2.1.3">连接表 <br/>
新增连接表,其中一个表的主键在连接表中做主键<br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-2.2.2" class="outline-4">
<h4 id="sec-2.2.2"><span class="section-number-4">2.2.2</span> 一对多 </h4>
<div class="outline-text-4" id="text-2.2.2">

<ul>
<li id="sec-2.2.2.1">外键 <br/>
一个表中的主键在另一个表中<br/>
</li>
<li id="sec-2.2.2.2">连接表 <br/>
新建连接表,2个表中的主键都在连接表中为主键<br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-2.2.3" class="outline-4">
<h4 id="sec-2.2.3"><span class="section-number-4">2.2.3</span> 多对多 </h4>
<div class="outline-text-4" id="text-2.2.3">

<p>同一对多连接表<br/>
新建连接表,2个表中的主键都在连接表中为主键<br/>
</p></div>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 映射定义 </h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3.1" class="outline-3">
<h3 id="sec-3.1"><span class="section-number-3">3.1</span> 单向 </h3>
<div class="outline-text-3" id="text-3.1">


</div>

<div id="outline-container-3.1.1" class="outline-4">
<h4 id="sec-3.1.1"><span class="section-number-4">3.1.1</span> 一对一 </h4>
<div class="outline-text-4" id="text-3.1.1">

<ul>
<li id="sec-3.1.1.1">外键 <br/>
一个类正常配置<br/>
另一个类用 many-to-one 来配置外键关联<br/>
&lt;many-to-one name="该类中关联另一个对象的属性" column="该属性对应的外键" unique="true"/&gt;<br/>
</li>
<li id="sec-3.1.1.2">主键 <br/>
一个类正常配置<br/>
另一个类用 one-to-one 来配置主键关联<br/>
&lt;one-to-one name="该类中关联另一个对象的属性"  constrained="true"/&gt;<br/>
</li>
<li id="sec-3.1.1.3">连接表 <br/>
一个类正常配置<br/>
另一个类用 join 来配置连接表<br/>
&lt;join table="连接表名称"&gt;<br/>
&lt;key column="连接表的主键"/&gt;<br/>
&lt;many-to-one name="实体类中关联另一个类的属性" unique="true"/&gt;<br/>
&lt;/join&gt;<br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-3.1.2" class="outline-4">
<h4 id="sec-3.1.2"><span class="section-number-4">3.1.2</span> 一对多 </h4>
<div class="outline-text-4" id="text-3.1.2">

<ul>
<li id="sec-3.1.2.1">外键 <br/>
一个类正常配置<br/>
另一个类用 set 配置 外键关联<br/>
&lt;set  name="该类中关联另一个对象的属性" table="关联到的另一个表名称" cascade="all"&gt;<br/>
&lt;key name="关联到的另一个表的主键"/&gt;<br/>
&lt;one-to-many class=""/&gt;<br/>
&lt;/set&gt;<br/>
</li>
<li id="sec-3.1.2.2">连接表 <br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-3.1.3" class="outline-4">
<h4 id="sec-3.1.3"><span class="section-number-4">3.1.3</span> 多对一 </h4>
<div class="outline-text-4" id="text-3.1.3">

<ul>
<li id="sec-3.1.3.1">外键 <br/>
</li>
<li id="sec-3.1.3.2">连接表 <br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-3.1.4" class="outline-4">
<h4 id="sec-3.1.4"><span class="section-number-4">3.1.4</span> 多对多 </h4>
<div class="outline-text-4" id="text-3.1.4">

</div>
</div>

</div>

<div id="outline-container-3.2" class="outline-3">
<h3 id="sec-3.2"><span class="section-number-3">3.2</span> 双向 </h3>
<div class="outline-text-3" id="text-3.2">


</div>

<div id="outline-container-3.2.1" class="outline-4">
<h4 id="sec-3.2.1"><span class="section-number-4">3.2.1</span> 一对一 </h4>
<div class="outline-text-4" id="text-3.2.1">

<ul>
<li id="sec-3.2.1.1">外键 <br/>
</li>
<li id="sec-3.2.1.2">主键 <br/>
</li>
<li id="sec-3.2.1.3">连接表 <br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-3.2.2" class="outline-4">
<h4 id="sec-3.2.2"><span class="section-number-4">3.2.2</span> 一对多 </h4>
<div class="outline-text-4" id="text-3.2.2">

<ul>
<li id="sec-3.2.2.1">外键 <br/>
</li>
<li id="sec-3.2.2.2">连接表 <br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-3.2.3" class="outline-4">
<h4 id="sec-3.2.3"><span class="section-number-4">3.2.3</span> 多对一 </h4>
<div class="outline-text-4" id="text-3.2.3">

<ul>
<li id="sec-3.2.3.1">外键 <br/>
</li>
<li id="sec-3.2.3.2">连接表 <br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-3.2.4" class="outline-4">
<h4 id="sec-3.2.4"><span class="section-number-4">3.2.4</span> 多对多 </h4>
<div class="outline-text-4" id="text-3.2.4">

</div>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: 
</p>
<p class="date"> Date: 2010-11-09 18:57:03 </p>
<p class="creator">HTML generated by org-mode 6.35i in emacs 24</p>
</div>
</div>
</body>
</html>
